Jason2866/Tasmota/lib/lib_ssl/bearssl-esp8266/src/hash/_sha_hal_idf5x.c
/*
 * _sha_hal_idf5x.c — BearSSL drop‑in with ESP32 HAL SHA acceleration
 *
 * This file provides hardware-accelerated implementations of BearSSL-compatible
 * hash functions (SHA-1, SHA-224, SHA-256, SHA-384, SHA-512) using the ESP-IDF 5.x
 * SHA HAL. It replaces the software digest core with direct access to the ESP32's
 * SHA engine, preserving BearSSL's context structure and API semantics.
 *
 * Each hash context uses a minimal layout:
 *   - val[] holds the midstate as a raw little-endian byte image.
 *   - buf[] holds the partial block (64 or 128 bytes).
 *   - count tracks the total input length in bytes.
 *
 * Endianness is preserved across state() and set_state() calls, allowing seamless
 * serialization and restoration of midstate snapshots. All conversions for hardware
 * interaction are localized to update() and out().
 *
 * This module is designed for drop-in replacement with no changes to BearSSL clients.
 * It supports multihash, midstate injection, and digest resumption.
 * 
 * Author: Christian Baars
 */

#include "t_inner.h"

#if defined(USE_SHA_ROM)
#if defined(ESP_PLATFORM) && !defined(ESP8266)

#include <stdint.h>

#include "freertos/FreeRTOS.h"

#if __has_include("soc/sha_caps.h")
# include "soc/sha_caps.h"
#elif __has_include("soc/soc_caps.h")
# include "soc/soc_caps.h"
#else
# error "No SHA capability header found"
#endif
#if SOC_SHA_SUPPORT_RESUME

#if __has_include("hal/sha_ll.h")
# include "hal/sha_ll.h"
# define HAVE_SHA_LL 1
#else
# define HAVE_SHA_LL 0
#endif


#define HAVE_HAL_SHA1    (SOC_SHA_SUPPORT_SHA1)
#define HAVE_HAL_SHA224  (SOC_SHA_SUPPORT_SHA224)
#define HAVE_HAL_SHA256  (SOC_SHA_SUPPORT_SHA256)
#define HAVE_HAL_SHA384  (SOC_SHA_SUPPORT_SHA384)
#define HAVE_HAL_SHA512  (SOC_SHA_SUPPORT_SHA512)

/* ------------------------------------------------------------------
 * Lock sharing with ESP-IDF mbedTLS / WPA / OTA.
 *
 * The SHA accelerator is a single shared peripheral. ESP-IDF's own
 * mbedTLS, Wi-Fi WPA2 EAPOL and OTA verification all reach it via the
 * lock published in esp_crypto_lock.h. A private portMUX here would
 * not serialize against those users — a TLS handshake concurrent with
 * a Wi-Fi key derivation would corrupt the midstate.
 *
 * Use the IDF lock when esp_crypto_lock.h is available (IDF 5.x for
 * every ESP32 family that has a SHA accelerator) and fall back to a
 * private spinlock only when the header is not present.
 * ------------------------------------------------------------------ */
#if __has_include("esp_crypto_lock.h")
# include "esp_crypto_lock.h"
# define BR_SHA_USE_IDF_LOCK 1
#endif

#if BR_SHA_USE_IDF_LOCK
/* The IDF SHA lock also covers AES (shared crypto-DMA on S2/S3). Still
 * call sha_ll_enable_bus_clock/reset_register here because the IDF lock
 * does not by itself touch the bus clock; mbedTLS does it inside its
 * own per-call wrapper. */
# define SHA_ENTER()  do { esp_crypto_sha_aes_lock_acquire(); \
                           { int __DECLARE_RCC_ATOMIC_ENV; \
                             sha_ll_enable_bus_clock(true); \
                             sha_ll_reset_register(); } } while (0)
# define SHA_EXIT()   do { { int __DECLARE_RCC_ATOMIC_ENV; \
                             sha_ll_enable_bus_clock(false); } \
                           esp_crypto_sha_aes_lock_release(); } while (0)
#else
static portMUX_TYPE s_sha_mux = portMUX_INITIALIZER_UNLOCKED;
# define SHA_ENTER()  {portENTER_CRITICAL(&s_sha_mux); int __DECLARE_RCC_ATOMIC_ENV; sha_ll_enable_bus_clock(true); sha_ll_reset_register();}
# define SHA_EXIT()   {portEXIT_CRITICAL(&s_sha_mux); int __DECLARE_RCC_ATOMIC_ENV; sha_ll_enable_bus_clock(false);}
#endif

#define SHA_WAIT()   {while (sha_ll_busy()) { } }

/* On ESP32-P4 with IDF >= 5.5 the SHA mode register must be programmed
 * explicitly via sha_ll_set_mode() before every operation; the bare
 * mode argument to sha_ll_load() / start_block() / continue_block() is
 * no longer sufficient. This macro is a no-op on every other target. */
#if defined(CONFIG_IDF_TARGET_ESP32P4) && defined(ESP_IDF_VERSION) && \
    defined(ESP_IDF_VERSION_VAL) && \
    ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
# define SHA_SET_MODE(m) sha_ll_set_mode(m)
#else
# define SHA_SET_MODE(m) ((void)0)
#endif

/* ================================================================
 * SHA-1 (HAL path, no save/restore) - needs char buf[112];
 * ================================================================ */
#if HAVE_HAL_SHA1

static void __attribute__((noinline))
sha_hal_process_block(void *state_buf, const void *blk,
                      esp_sha_type type, size_t digest_words,
                      size_t block_words, bool first)
{
    SHA_ENTER();
    SHA_SET_MODE(type);
    if (!first) {
        sha_ll_write_digest(type, state_buf, digest_words);
    }
    sha_ll_fill_text_block(blk, block_words);
    if (first) {
        sha_ll_start_block(type);
    } else {
        sha_ll_continue_block(type);
    }
    SHA_WAIT();
    sha_ll_read_digest(type, state_buf, digest_words);
    SHA_EXIT();
}

static const uint8_t S1_IV_BYTES[20] PROGMEM = {
    0x67,0x45,0x23,0x01, 0xEF,0xCD,0xAB,0x89,
    0x98,0xBA,0xDC,0xFE, 0x10,0x32,0x54,0x76,
    0xC3,0xD2,0xE1,0xF0
};

void br_sha1_init(br_sha1_context *cc)
{
    cc->vtable = &br_sha1_vtable;
    cc->count = 0;
    memset(cc->buf, 0, sizeof cc->buf);
    /* Store IV bytes exactly as given (LE words) into cc->val */
    memcpy(cc->val, S1_IV_BYTES, sizeof S1_IV_BYTES);
}

void br_sha1_update(br_sha1_context *cc, const void *data, size_t len)
{
    const uint8_t *src = data;
    size_t used = (size_t)(cc->count & 63U);

    if (!len) return;
    cc->count += len;

    if (used) {
        size_t take = 64 - used;
        if (take > len) take = len;
        memcpy(cc->buf + used, src, take);
        src += take;
        len -= take;
        used += take;
        if (used == 64) {
            sha_hal_process_block(cc->val, cc->buf, SHA1, 5, 16, cc->count == 64);
            used = 0;
        }
    }
    while (len >= 64) {
        sha_hal_process_block(cc->val, src, SHA1, 5, 16,
                              (cc->count - len == 0) && !used);
        src += 64;
        len -= 64;
    }
    if (len) {
        memcpy(cc->buf, src, len);
    }
}

void br_sha1_out(const br_sha1_context *cc, void *out)
{
    br_sha1_context ctx = *cc;
    size_t used = (size_t)(ctx.count & 63U);
    uint64_t bit_len = (uint64_t)ctx.count << 3;
    bool first = (ctx.count < 64);

