Jason2866/Tasmota/lib/lib_ssl/bearssl-esp8266/src/hash/_sha_hal_idf5x.c
    ctx.buf[used++] = 0x80;
    if (used > 56) {
        memset(ctx.buf + used, 0, 64 - used);
        sha_hal_process_block(ctx.val, ctx.buf, SHA1, 5, 16, first);
        used = 0;
        first = false;
    }
    memset(ctx.buf + used, 0, 56 - used);
    br_enc64be(ctx.buf + 56, bit_len);
    sha_hal_process_block(ctx.val, ctx.buf, SHA1, 5, 16, first);
    memcpy(out, ctx.val, 20);
}

uint64_t br_sha1_state(const br_sha1_context *cc, void *dst)
{
    /* Export raw 20-byte LE midstate image exactly as stored */
    memcpy(dst, cc->val, 20);
    return cc->count;
}

void br_sha1_set_state(br_sha1_context *cc, const void *src, uint64_t count)
{
    if (!(cc->vtable == &br_sha1_vtable)) {
        cc->vtable = &br_sha1_vtable;
    }
    /* Import raw 20-byte LE midstate image exactly as provided */
    memcpy(cc->val, src, 20);
    cc->count = count;
    memset(cc->buf, 0, sizeof cc->buf);
}

const br_hash_class br_sha1_vtable PROGMEM = {
    sizeof(br_sha1_context),
    BR_HASHDESC_ID(br_sha1_ID)
      | BR_HASHDESC_OUT(20)
      | BR_HASHDESC_LBLEN(6)
      | BR_HASHDESC_MD_PADDING
      | BR_HASHDESC_MD_PADDING_BE
      | BR_HASHDESC_STATE(20),
    (void (*)(const br_hash_class **)) &br_sha1_init,
    (void (*)(const br_hash_class **, const void *, size_t)) &br_sha1_update,
    (void (*)(const br_hash_class *const *, void *)) &br_sha1_out,
    (uint64_t (*)(const br_hash_class *const *, void *)) &br_sha1_state,
    (void (*)(const br_hash_class **, const void *, uint64_t)) &br_sha1_set_state
};

#endif /* HAVE_HAL_SHA1 */

/* ================================================================
 * SHA-224 (HAL path, no save/restore)
 * ================================================================ */
#if HAVE_HAL_SHA224

/* SHA-224 IV as 32-bit words (FIPS 180-4) */
static const uint32_t S224_IV_WORDS[8] = {
    0xc1059ed8U, 0x367cd507U, 0x3070dd17U, 0xf70e5939U,
    0xffc00b31U, 0x68581511U, 0x64f98fa7U, 0xbefa4fa4U
};

void br_sha224_init(br_sha224_context *cc) {
    cc->vtable = &br_sha224_vtable;
    cc->count = 0;
    memset(cc->buf, 0, sizeof cc->buf);
    /* Internal state is LE; encode IV directly in LE form into cc->val */
    br_range_enc32le(cc->val, S224_IV_WORDS, 8);
}

/* Reuse SHA-256 out, then truncate to 28 bytes */
void br_sha224_out(const br_sha224_context *cc, void *out) {
    uint8_t full[32];
    br_sha256_out((const br_sha256_context *)cc, full);
    memcpy(out, full, 28);
}

const br_hash_class br_sha224_vtable PROGMEM = {
    sizeof(br_sha224_context),
    BR_HASHDESC_ID(br_sha224_ID)
      | BR_HASHDESC_OUT(28)
      | BR_HASHDESC_LBLEN(6)
      | BR_HASHDESC_MD_PADDING
      | BR_HASHDESC_MD_PADDING_BE
      | BR_HASHDESC_STATE(32),
    (void (*)(const br_hash_class **)) &br_sha224_init,
    (void (*)(const br_hash_class **, const void *, size_t)) &br_sha224_update,
    (void (*)(const br_hash_class *const *, void *)) &br_sha224_out,
    (uint64_t (*)(const br_hash_class *const *, void *)) &br_sha224_state,
    (void (*)(const br_hash_class **, const void *, uint64_t)) &br_sha224_set_state
};

#endif /* HAVE_HAL_SHA224 */

/* ================================================================
 * SHA-256 (HAL path, save/restore)
 * ================================================================ */
#if HAVE_HAL_SHA256 && defined(SOC_SHA_SUPPORT_RESUME)

/* Fixed SHA-256 IV in big-endian bytes (spec-defined) */
static const uint8_t S256_IV_BYTES[32] PROGMEM = {
    0x6a, 0x09, 0xe6, 0x67, 0xbb, 0x67, 0xae, 0x85,
    0x3c, 0x6e, 0xf3, 0x72, 0xa5, 0x4f, 0xf5, 0x3a,
    0x51, 0x0e, 0x52, 0x7f, 0x9b, 0x05, 0x68, 0x8c,
    0x1f, 0x83, 0xd9, 0xab, 0x5b, 0xe0, 0xcd, 0x19
};

/* Maintain the partial block in cc->buf[] (64 bytes) */
static inline void s256_update_partial(br_sha256_context *cc,
                                       const uint8_t *data_ptr,
                                       size_t data_len,
                                       size_t prev_partial_len)
{
    size_t new_partial_len = (prev_partial_len + data_len) & 63U;

    if (new_partial_len == 0) {
        /* Exact block boundary: clear partial buffer */
        memset(cc->buf, 0, sizeof cc->buf);
        return;
    }

    if (data_len >= new_partial_len) {
        /* Tail entirely from current input */
        memcpy(cc->buf, data_ptr + (data_len - new_partial_len), new_partial_len);
    } else {
        /* Need some bytes from previous partial tail */
        size_t need_prev = new_partial_len - data_len;
        if (need_prev && need_prev <= prev_partial_len) {
            memmove(cc->buf, cc->buf + (prev_partial_len - need_prev), need_prev);
        } else if (need_prev) {
            memset(cc->buf, 0, need_prev);
        }
        memcpy(cc->buf + need_prev, data_ptr, data_len);
    }

    if (new_partial_len < sizeof cc->buf) {
        memset(cc->buf + new_partial_len, 0, sizeof cc->buf - new_partial_len);
    }
}

void br_sha256_init(br_sha256_context *cc)
{
    cc->vtable = &br_sha256_vtable;
    cc->count = 0;
    memset(cc->buf, 0, sizeof cc->buf);
    /* Keep midstate bytes exactly as IV (BE byte image), as in the original */
    memcpy(cc->val, S256_IV_BYTES, 32);
}

void br_sha224_update(br_sha224_context *cc, const void *data, size_t len)
{
    if (!len) return;

    /* Embedded mode selection by vtable pointer (no desc, no tags) */
    const int mode = (cc->vtable == &br_sha256_vtable) ? SHA2_256 : SHA2_224;

    const uint8_t *data_ptr = (const uint8_t *)data;
    const uint8_t *orig_ptr = data_ptr;
    size_t orig_len = len;

    size_t prev_partial_len = (size_t)(cc->count & 63U);
    bool starting_from_iv = (cc->count == 0) && (prev_partial_len == 0);
    size_t stitch_take = 0;
    if (prev_partial_len && len >= (64 - prev_partial_len))
        stitch_take = 64 - prev_partial_len;

    if (stitch_take || len >= 64) {
        size_t block_count_in_run = 0;

        SHA_ENTER();
        SHA_SET_MODE(mode);

        /* Complete the partial block (stitch) if needed */
        if (stitch_take) {
            uint32_t midstate_words[8];
            /* Original semantics: decode state from LE words before seeding HW */
            br_range_dec32le(midstate_words, 8, cc->val);
            sha_ll_load(mode);
            sha_ll_write_digest(mode, midstate_words, 8);

            uint8_t first_block[64];
            memcpy(first_block, cc->buf, prev_partial_len);
            memcpy(first_block + prev_partial_len, data_ptr, stitch_take);

            sha_ll_fill_text_block(first_block, 16);
            sha_ll_continue_block(mode);
            SHA_WAIT();

            data_ptr += stitch_take;
            len -= stitch_take;
            block_count_in_run = 1;
        }

        /* Process full 64-byte blocks */
        if (len >= 64) {
            if (starting_from_iv && stitch_take == 0) {
                /* Start from IV directly */
                sha_ll_fill_text_block(data_ptr, 16);
                sha_ll_start_block(mode);
                SHA_WAIT();
                data_ptr += 64;
                len -= 64;
                block_count_in_run = 1;
            } else if (block_count_in_run == 0) {
                /* Seed from current midstate once before the run */
                uint32_t midstate_words2[8];
                br_range_dec32le(midstate_words2, 8, cc->val);
                sha_ll_load(mode);
                sha_ll_write_digest(mode, midstate_words2, 8);
            }

#if defined(CONFIG_IDF_TARGET_ARCH_RISCV)  /* RISC-V: enforce 8-block (512B) window with checkpointing */
            while (len >= 64) {
                sha_ll_fill_text_block(data_ptr, 16);
                sha_ll_continue_block(mode);
                SHA_WAIT();

                data_ptr += 64;
                len -= 64;
                block_count_in_run++;

                if (block_count_in_run == 8 && len >= 64) {
                    uint32_t midstate_words3[8];
                    sha_ll_load(mode);
                    sha_ll_read_digest(mode, midstate_words3, 8);
                    sha_ll_load(mode);
                    sha_ll_write_digest(mode, midstate_words3, 8);
                    block_count_in_run = 0;
                }
            }
#else       /* Xtensa: simple per-block processing, no extra checkpointing */
            while (len >= 64) {
                sha_ll_fill_text_block(data_ptr, 16);
                sha_ll_continue_block(mode);
                SHA_WAIT();
                data_ptr += 64;
                len -= 64;
            }
#endif
        }

        /* Commit midstate back; keep the same on-wire format as before: LE words in cc->val */
        {
            uint32_t tmp_words[8];
            sha_ll_load(mode);
            SHA_WAIT();
            sha_ll_read_digest(mode, tmp_words, 8);
            br_range_enc32le(cc->val, tmp_words, 8);
        }
        SHA_EXIT();
    }

    /* Bookkeeping and partial buffer maintenance */
    cc->count += orig_len;
    s256_update_partial((br_sha256_context *)cc, orig_ptr, orig_len, prev_partial_len);
}

void br_sha256_out(const br_sha256_context *cc, void *out)
{
    uint8_t  saved_partial[sizeof cc->buf];
    uint64_t saved_count = cc->count;
    uint8_t  saved_state[32];

    memcpy(saved_partial, cc->buf, sizeof cc->buf);
    memcpy(saved_state, cc->val, 32);

    uint8_t partial_len = (uint8_t)(saved_count & 63U);
    const int mode = (cc->vtable == &br_sha256_vtable) ? SHA2_256 : SHA2_224;

    bool midstate_is_iv = (memcmp(saved_state, S256_IV_BYTES, 32) == 0);
    bool no_full_blocks_done = (saved_count < 64);
    bool must_start_from_iv = midstate_is_iv && no_full_blocks_done;

    SHA_ENTER();
    SHA_SET_MODE(mode);

    if (!must_start_from_iv) {
        uint32_t midstate_words[8];
        /* Original semantics: state stored as LE words in cc->val */
        br_range_dec32le(midstate_words, 8, saved_state);
        sha_ll_load(mode);
        sha_ll_write_digest(mode, midstate_words, 8);
    }

