Jason2866/Tasmota/lib/lib_ssl/bearssl-esp8266/src/hash/_sha_hal_idf5x.c
    uint8_t final_blocks[128];
    memcpy(final_blocks, saved_partial, partial_len);
    final_blocks[partial_len] = 0x80;

    size_t zero_len = (partial_len < 56) ? (56 - partial_len - 1)
                                         : (120 - partial_len - 1);
    if (zero_len) {
        memset(final_blocks + partial_len + 1, 0, zero_len);
    }

    uint64_t bit_length = saved_count * 8;
    size_t len_pos = partial_len + 1 + zero_len;
    for (int i = 0; i < 8; i++) {
        final_blocks[len_pos + i] = (uint8_t)(bit_length >> (56 - 8 * i));
    }
    size_t total_final_len = len_pos + 8;

    if (total_final_len == 64) {
        sha_ll_fill_text_block(final_blocks, 16);
        if (must_start_from_iv)
            sha_ll_start_block(mode);
        else
            sha_ll_continue_block(mode);
        SHA_WAIT();
    } else {
        sha_ll_fill_text_block(final_blocks, 16);
        if (must_start_from_iv)
            sha_ll_start_block(mode);
        else
            sha_ll_continue_block(mode);
        SHA_WAIT();
        sha_ll_fill_text_block(final_blocks + 64, 16);
        sha_ll_continue_block(mode);
        SHA_WAIT();
    }

    {
        uint32_t tmp_words[8];
        sha_ll_load(mode);
        sha_ll_read_digest(mode, tmp_words, 8);
        SHA_EXIT();
        /* Final digest serialization remains LE as in your original */
        br_range_enc32le(out, tmp_words, 8);
    }

    /* Non-destructive out(): restore snapshot */
    memcpy(((br_sha256_context *)cc)->buf, saved_partial, sizeof cc->buf);
    ((br_sha256_context *)cc)->count = saved_count;
    /* cc->val was never modified in out() */
}

uint64_t br_sha224_state(const br_sha256_context *cc, void *dst)
{
    /* Export midstate bytes exactly as stored (LE words image), unchanged */
    memcpy(dst, cc->val, 32);
    return cc->count;
}

void br_sha224_set_state(br_sha256_context *cc, const void *src, uint64_t count)
{
    if( !(cc->vtable == &br_sha256_vtable) && !(cc->vtable == &br_sha224_vtable)){
        cc->vtable = &br_sha256_vtable; /* safety for multihash fresh gen context */
    }
    /* Reset partial, set count, and import state bytes exactly as provided */
    memset(cc->buf, 0, sizeof cc->buf);
    memcpy(cc->val, src, 32);
    cc->count = count;
}

const br_hash_class br_sha256_vtable PROGMEM = {
    sizeof(br_sha256_context),
    BR_HASHDESC_ID(br_sha256_ID)
        | BR_HASHDESC_OUT(32)
        | BR_HASHDESC_STATE(32)
        | BR_HASHDESC_LBLEN(6)
        | BR_HASHDESC_MD_PADDING
        | BR_HASHDESC_MD_PADDING_BE,
    (void (*)(const br_hash_class **))&br_sha256_init,
    (void (*)(const br_hash_class **,
        const void *, size_t))&br_sha256_update,
    (void (*)(const br_hash_class *const *, void *))&br_sha256_out,
    (uint64_t (*)(const br_hash_class *const *, void *))&br_sha256_state,
    (void (*)(const br_hash_class **, const void *, uint64_t))
        &br_sha256_set_state
};

#endif /* HAVE_HAL_SHA256 && SOC_SHA_SUPPORT_RESUME */

/* ================================================================
 * SHA-384 (HAL path, no save/restore)
 * ================================================================ */
#if HAVE_HAL_SHA384

static const uint64_t S384_IV_WORDS[8] = {
    0xcbbb9d5dc1059ed8ULL, 0x629a292a367cd507ULL,
    0x9159015a3070dd17ULL, 0x152fecd8f70e5939ULL,
    0x67332667ffc00b31ULL, 0x8eb44a8768581511ULL,
    0xdb0c2e0d64f98fa7ULL, 0x47b5481dbefa4fa4ULL
};

void br_sha384_init(br_sha384_context *cc) {
    cc->vtable = &br_sha384_vtable;
    cc->count = 0;
    memset(cc->buf, 0, sizeof cc->buf);
    /* Internal state is LE; encode IV directly in LE form into cc->val */
    br_range_enc64le(cc->val, S384_IV_WORDS, 8);
}

void br_sha384_update(br_sha384_context *cc, const void *data, size_t len) {
    if (!len) return;
    const uint8_t *src = (const uint8_t *)data;
    size_t used = (size_t)(cc->count & 127U);
    uint64_t prior_count = cc->count;
    cc->count += len;

    if (used) {
        size_t take = 128 - used;
        if (take > len) take = len;
        memcpy(cc->buf + used, src, take);
        src += take;
        len -= take;
        used += take;
        if (used == 128) {
            uint64_t st_be[8];
            br_range_dec64le(st_be, 8, cc->val);
            br_range_enc64be(st_be, st_be, 8);
            SHA_ENTER();
            SHA_SET_MODE(SHA2_512); sha_ll_load(SHA2_512);
            sha_ll_write_digest(SHA2_512, st_be, 16);
            sha_ll_fill_text_block(cc->buf, 32);
            sha_ll_continue_block(SHA2_512);
            SHA_WAIT();
            sha_ll_read_digest(SHA2_512, st_be, 16);
            SHA_EXIT();
            br_range_dec64be(st_be, 8, st_be);
            br_range_enc64le(cc->val, st_be, 8);
            prior_count += 128;
            used = 0;
        }
    }

    if (len >= 128) {
        uint64_t st_be[8];
        br_range_dec64le(st_be, 8, cc->val);
        br_range_enc64be(st_be, st_be, 8);
        bool first = (prior_count == 0);
        SHA_ENTER();
        SHA_SET_MODE(SHA2_512); sha_ll_load(SHA2_512);
        sha_ll_write_digest(SHA2_512, st_be, 16);
        while (len >= 128) {
            sha_ll_fill_text_block(src, 32);
            if (first) {
                sha_ll_start_block(SHA2_512);
                first = false;
            } else {
                sha_ll_continue_block(SHA2_512);
            }
            SHA_WAIT();
            src += 128;
            len -= 128;
        }
        sha_ll_read_digest(SHA2_512, st_be, 16);
        SHA_EXIT();
        br_range_dec64be(st_be, 8, st_be);
        br_range_enc64le(cc->val, st_be, 8);
    }

    if (len) memcpy(cc->buf, src, len);
}

void br_sha384_out(const br_sha384_context *cc, void *out) {
    br_sha384_context ctx = *cc;
    size_t used = (size_t)(ctx.count & 127U);
    uint64_t bit_hi = (uint64_t)(ctx.count >> 61);
    uint64_t bit_lo = (uint64_t)(ctx.count << 3);

    ctx.buf[used++] = 0x80;
    if (used > 112) {
        memset(ctx.buf + used, 0, 128 - used);
        uint64_t st_be[8];
        br_range_dec64le(st_be, 8, ctx.val);
        br_range_enc64be(st_be, st_be, 8);
        SHA_ENTER();
        SHA_SET_MODE(SHA2_512); sha_ll_load(SHA2_512);
        sha_ll_write_digest(SHA2_512, st_be, 16);
        sha_ll_fill_text_block(ctx.buf, 32);
        sha_ll_continue_block(SHA2_512);
        SHA_WAIT();
        sha_ll_read_digest(SHA2_512, st_be, 16);
        SHA_EXIT();
        br_range_dec64be(st_be, 8, st_be);
        br_range_enc64le(ctx.val, st_be, 8);
        used = 0;
    }

    memset(ctx.buf + used, 0, 112 - used);
    br_enc64be(ctx.buf + 112, bit_hi);
    br_enc64be(ctx.buf + 120, bit_lo);

    uint64_t st_be2[8];
    br_range_dec64le(st_be2, 8, ctx.val);
    br_range_enc64be(st_be2, st_be2, 8);
    SHA_ENTER();
    SHA_SET_MODE(SHA2_512); sha_ll_load(SHA2_512);
    sha_ll_write_digest(SHA2_512, st_be2, 16);
    sha_ll_fill_text_block(ctx.buf, 32);
    sha_ll_continue_block(SHA2_512);
    SHA_WAIT();
    sha_ll_read_digest(SHA2_512, st_be2, 16);
    SHA_EXIT();

    br_range_dec64be(st_be2, 8, st_be2);
    br_range_enc64be(out, st_be2, 6);
}

