Jason2866/Tasmota/lib/lib_ssl/bearssl-esp8266/src/hash/_sha_hal_idf5x.c
uint64_t br_sha384_state(const br_sha384_context *cc, void *dst) {
    /* Export raw 64-byte LE midstate image exactly as stored */
    memcpy(dst, cc->val, 64);
    return cc->count;
}

void br_sha384_set_state(br_sha384_context *cc, const void *src, uint64_t count) {
    if (!(cc->vtable == &br_sha384_vtable)) {
        cc->vtable = &br_sha384_vtable;
    }
    /* Import raw 64-byte LE midstate image exactly as provided */
    memcpy(cc->val, src, 64);
    cc->count = count;
    memset(cc->buf, 0, sizeof cc->buf);
}

const br_hash_class br_sha384_vtable PROGMEM = {
    sizeof(br_sha384_context),
    BR_HASHDESC_ID(br_sha384_ID)
        | BR_HASHDESC_OUT(48)
        | BR_HASHDESC_STATE(64)
        | BR_HASHDESC_LBLEN(7)
        | BR_HASHDESC_MD_PADDING
        | BR_HASHDESC_MD_PADDING_BE
        | BR_HASHDESC_MD_PADDING_128,
    (void (*)(const br_hash_class **)) &br_sha384_init,
    (void (*)(const br_hash_class **, const void *, size_t)) &br_sha384_update,
    (void (*)(const br_hash_class *const *, void *)) &br_sha384_out,
    (uint64_t (*)(const br_hash_class *const *, void *)) &br_sha384_state,
    (void (*)(const br_hash_class **, const void *, uint64_t)) &br_sha384_set_state
};

#endif /* HAVE_HAL_SHA384 */

/* ================================================================
 * SHA-512 (HAL path, no save/restore)
 * Uses SHA-384 update/state/set_state
 * ================================================================ */
#if HAVE_HAL_SHA512

static const uint64_t S512_IV_WORDS[8] = {
    0x6a09e667f3bcc908ULL, 0xbb67ae8584caa73bULL,
    0x3c6ef372fe94f82bULL, 0xa54ff53a5f1d36f1ULL,
    0x510e527fade682d1ULL, 0x9b05688c2b3e6c1fULL,
    0x1f83d9abfb41bd6bULL, 0x5be0cd19137e2179ULL
};

void br_sha512_init(br_sha512_context *cc) {
    cc->vtable = &br_sha512_vtable;
    cc->count = 0;
    memset(cc->buf, 0, sizeof cc->buf);
    /* Internal state is LE; encode IV directly in LE form into cc->val */
    br_range_enc64le(cc->val, S512_IV_WORDS, 8);
}

void br_sha512_out(const br_sha512_context *cc, void *out) {
    br_sha512_context ctx = *cc;
    size_t used = (size_t)(ctx.count & 127U);
    uint64_t bit_hi = (uint64_t)(ctx.count >> 61);
    uint64_t bit_lo = (uint64_t)(ctx.count << 3);

    ctx.buf[used++] = 0x80;
    if (used > 112) {
        memset(ctx.buf + used, 0, 128 - used);
        uint64_t st_be[8];
        br_range_dec64le(st_be, 8, ctx.val);
        br_range_enc64be(st_be, st_be, 8);
        SHA_ENTER();
        SHA_SET_MODE(SHA2_512); sha_ll_load(SHA2_512);
        sha_ll_write_digest(SHA2_512, st_be, 16);
        sha_ll_fill_text_block(ctx.buf, 32);
        sha_ll_continue_block(SHA2_512);
        SHA_WAIT();
        sha_ll_read_digest(SHA2_512, st_be, 16);
        SHA_EXIT();
        br_range_dec64be(st_be, 8, st_be);
        br_range_enc64le(ctx.val, st_be, 8);
        used = 0;
    }

    memset(ctx.buf + used, 0, 112 - used);
    br_enc64be(ctx.buf + 112, bit_hi);
    br_enc64be(ctx.buf + 120, bit_lo);

    uint64_t st_be2[8];
    br_range_dec64le(st_be2, 8, ctx.val);
    br_range_enc64be(st_be2, st_be2, 8);
    SHA_ENTER();
    SHA_SET_MODE(SHA2_512); sha_ll_load(SHA2_512);
    sha_ll_write_digest(SHA2_512, st_be2, 16);
    sha_ll_fill_text_block(ctx.buf, 32);
    sha_ll_continue_block(SHA2_512);
    SHA_WAIT();
    sha_ll_read_digest(SHA2_512, st_be2, 16);
    SHA_EXIT();

    /* Output digest in big‑endian bytes as BearSSL expects */
    br_range_dec64be(st_be2, 8, st_be2);
    br_range_enc64be(out, st_be2, 8);
}

const br_hash_class br_sha512_vtable PROGMEM = {
    sizeof(br_sha512_context),
    BR_HASHDESC_ID(br_sha512_ID)
      | BR_HASHDESC_OUT(64)
      | BR_HASHDESC_STATE(64)
      | BR_HASHDESC_LBLEN(7)
      | BR_HASHDESC_MD_PADDING
      | BR_HASHDESC_MD_PADDING_BE
      | BR_HASHDESC_MD_PADDING_128,
    (void (*)(const br_hash_class **)) &br_sha512_init,
    (void (*)(const br_hash_class **, const void *, size_t)) &br_sha384_update,  /* reuse SHA-384 update */
    (void (*)(const br_hash_class *const *, void *)) &br_sha512_out,
    (uint64_t (*)(const br_hash_class *const *, void *)) &br_sha512_state,
    (void (*)(const br_hash_class **, const void *, uint64_t)) &br_sha512_set_state
};

#endif /* HAVE_HAL_SHA512 */

#else
/* ===== ESP8266 - leave it unchanged ===== */
#endif // SOC_SHA_SUPPORT_RESUME
#endif // defined(ESP_PLATFORM) && !defined(ESP8266)
#endif //USE_SHA_ROM
